<?php
use App\Enums\Brand;

#銷售POS Shop
#複合店
return [
	#複合店=> 梁社漢品項訂單在存在八方及御廚DB
	#20260709:關西中興|新店綠灣算特殊店,不是標準複合店模式,基本上營收都會歸屬八方
	'dualBrandedId' => [
		'0001' => '106003', #台大(POSx2)
		#'0966' => '112004', #御廚石牌直營店(已閉店)
		#'0983' => '306001', #關西中興(POSx1)
		#'0974' => '', #新店綠灣(POSx1, 只有八方有門店設定, 故用訂貨的No:2310012)
    ],
	
	#複合店訂貨的StoreKey(7碼),用來排除營收用, 只有銷售有關的才排除
	'dualBrandedExceptStoreKey' => [
		Brand::BAFANG->value => [],
		
		Brand::BUYGOOD->value => [
			#'106U003', #台大:兩台POS先不用排除
			'112U004', #御廚石牌直營店
			'306U001', #關西中興
			'2310012', #新店綠灣
		]
	],
	
	#排除門店
	'except' => [
		Brand::BAFANG->value => [
			'0000',	'0030', '9999', 'M0020', 'M0023', 
			'M0024', '8WAYB0', '9999', 'KK-SP', 'KK003', 
			'KK004', 'KK005', 'KK006', 'M0002', 'M0003', 
			'M0004', 'M0005', 'M0006', 'M0007', 'M0008', 
			'M0009', 'M0010', 'M0011', 'M0012', 'M0013', 
			'M0014', 'M0015', 'M0016', 'M0017', 'M0018', 
			'M0021', 'M0022', 'M0025', 'M0030', 'X0058', 
			'X0062', 'KK001', 'KK002', 'KK007', 'M0019', 
			'0124',  '1053',  '1189',
			'9901', '9902', '9903', 
		],
		Brand::BUYGOOD->value => [
			'000030', 'KK-CB', 'KK-T22', 'Test1', '9999', 'Chop',
			'KK-F', 'KK-K22', 'KK-NS', 'KK-SP', 'KK-TN1',
			'Normal', 'Q001', 'TEST2', '100901', '100902', 
			'100903', '100904', '100905', '100906', '100907', 
			'100908', 'KK-TS', 'THSR'
		],
		Brand::FJVEGGIE->value => [
		],
	],
	
	'type' => [
		1 => '直營店',
		2 => '加盟店',
	],
];


/* gid in bafang
1	大台北區
2	桃竹苗區
3	中彰投區
4	雲嘉南區
5	宜蘭區
6	大高雄區
7	花蓮區
*/

/* gid in buygood
A01	大台北區
A02	桃竹苗區
A03	中彰投區
A04	雲嘉南區
A05	大高雄區
A06	宜蘭區
A07	花蓮區
*/
