<?php

#Product category
return [
	#月總量/均量(By factory) , 避免前排序問題, 改為獨立array, 不使用key-value
	'monthly' => [
		['code' => '0001', 	'name' => '招牌餡',		],
		['code' => '0002', 	'name' => '韭菜餡',   	],
		['code' => '0003', 	'name' => '韓式辣味餡',	],
		['code' => '0005', 	'name' => '咖哩餡',   	],
		['code' => '0011', 	'name' => '玉米餡',   	],
		['code' => '0015', 	'name' => '新蔬食餡', 	],
		['code' => '0006', 	'name' => '菜肉餡',   	],
		['code' => '0007', 	'name' => '餛飩餡',   	],
		['code' => '2267', 	'name' => '滷排骨',   	],
		['code' => '2271', 	'name' => '古早味排骨',	],
	],
	#餡總量(By store)
	'totalCount' => [
		'code' => [
			'0001' => ['name' => '招牌餡',		],
			'0002' => ['name' => '韭菜餡',   	],
			'0003' => ['name' => '韓式辣味餡',	],
			'0005' => ['name' => '咖哩餡',   	],
			'0011' => ['name' => '玉米餡',   	],
			'0015' => ['name' => '新蔬食餡', 		],
			'0006' => ['name' => '菜肉餡',   	],
			'0007' => ['name' => '餛飩餡',   	],
			'0301' => ['name' => '白細麵球', 		],
			'0302' => ['name' => '白粗麵球', 		],
			'0303' => ['name' => '白細麵球', 		],
			'0304' => ['name' => '白粗麵球', 		],
			'2267' => ['name' => '滷排骨',   	],
			'2271' => ['name' => '古早味排骨',	],
		],
		'group' => [
			'g1' => [
				'name' => '餡',
				'code' => [
					'0001',
					'0002',
					'0003',
					'0005',
					'0011',
					'0015',
				]
			],
			'g2' => [
				'name' => '粗細麵',
				'code' => [
					'0301',
					'0302',
					'0303',
					'0304',
				]
			],
			'g3' => [
				'name' => '菜肉餡',
				'code' => [
					'0006',
				]
			],
			'g4' => [
				'name' => '餛飩餡',
				'code' => [
					'0007',
				]
			],
			'g5' => [
				'name' => '滷排骨',
				'code' => [
					'2267',
				]
			],
			'g6' => [
				'name' => '古早味排骨',
				'code' => [
					'2271',
				]
			],
		]
	],
];

/* 月初報表 0006 * 2.5 / 0015 * 1.8 已沒有:0008 0012 0013 0014
餡總量		0001 0002 0003 0005, 0011 0015, 
粗細麵總量	0301 0302 0303 0304
菜肉餡		0006
餛飩餡		0007

#南北廠命名有不同步
招牌餡		0001
韭菜餡		0002
韓式辣味餡	0003
咖哩餡		0005
菜肉餡		0006
餛飩餡		0007
玉米餡		0011
新蔬食餡		0015 * 1.8

白細麵球	0301
粗麵球	0302
白細麵球	0303
白粗麵球	0304

滷排骨	2267
*/
