<?php

use App\Enums\Brand;

#Purchase report config
#避免前端排序問題, 改為獨立array, 不使用key-value
return [
	#營運概況
	'performance' => [
		Brand::BAFANG->value => [
			#餡
			'filling' => [
				['code' => '0001', 	'name' => '招牌餡',	],
				['code' => '0002', 	'name' => '韭菜餡',  ],
				['code' => '0003', 	'name' => '辣味餡',	],
				['code' => '0005', 	'name' => '咖哩餡',  ],
				['code' => '0011', 	'name' => '玉米餡',  ],
				['code' => '0015', 	'name' => '蔬食餡',	], #0015 * 1.8
			],
		
			#皮
			'wrapper' => [
				['code' => '0101', 	'name' => '水餃皮',	],
				['code' => '0102', 	'name' => '鍋貼皮',  ],
				['code' => '0104', 	'name' => '咖哩皮',	],
				['code' => '0110', 	'name' => '玉米皮',  ],
				['code' => '0117', 	'name' => '蔬食皮',  ],
			],
		
			#飲料
			'drink' => [
				['code' => '0201', 	'name' => '白豆漿',	],
				['code' => '0202', 	'name' => '黑豆漿',  ],
				['code' => '0203', 	'name' => '無糖豆漿',	],
				['code' => '0205', 	'name' => '真傳紅茶',	],
			],
		],
		
		Brand::LUOBO->value => [
			#餡
			'filling' => [
				['code' => '0006', 	'name' => '菜肉餡',	],
				['code' => '0007', 	'name' => '餛飩餡',  ],
			],
		
			#皮
			'wrapper' => [
				['code' => '0107', 	'name' => '珍珠餛飩皮',	],
				['code' => '0106', 	'name' => '綠餛飩皮',  ],
			],
		
			#麵球
			'noodle' => [
				['code' => '0301', 	'name' => '白細麵球',	],
				['code' => '0302', 	'name' => '粗麵球',  ],
			],
		],
	],
];

/* 0006 * 2.5 / 0015 * 1.8 已沒有:0008 0012 0013 0014
餡總量		0001 0002 0003 0005, 0011 0015, 
粗細麵總量	0301 0302 0303 0304
菜肉餡		0006
餛飩餡		0007

#南北廠命名有不同步
招牌餡		0001
韭菜餡		0002
韓式辣味餡	0003
咖哩餡		0005
菜肉餡		0006
餛飩餡		0007
玉米餡		0011
新蔬食餡		0015 * 1.8

白細麵球	0301
粗麵球	0302
白細麵球	0303
白粗麵球	0304

滷排骨	2267
*/
